Fixes. Add Mermaid diagrams
